README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-17 Fri 11:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgee1075b">0.1. Documentation</a></li>
<li><a href="#orge174112">0.2. Installation</a>
<ul>
<li><a href="#orgefaf9fa">0.2.1. Haskell</a></li>
<li><a href="#org009be7d">0.2.2. Install Hydra</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org42932bb">1. About Hydra</a></div>
</div>
<p>
Hydra is a functional computer hardware description language for
specifying the structure and behavior of digital circuits. It supports
several levels of abstraction, including logic gates, register
transfer level, datapath and control, and processors. There are tools
for simulating circuits, generating netlists, and emulating
instruction set architectures. It is an embedded domain specific
language implemented using Haskell.
</p>

<p>
This is free and open source software released under the GPL-3
license.
</p>

<div id="outline-container-orgee1075b" class="outline-3">
<h3 id="orgee1075b"><span class="section-number-3">0.1</span> Documentation</h3>
<div class="outline-text-3" id="text-0-1">
<p>
There are several forms of documentation.
</p>
<ul class="org-ul">
<li>The user guide, available in docs/HydraUserGuide, gives a tutorial
explanation of how to use the software.</li>
<li>The API reference is in the dist-newstyle directory.  The exact
location depends on software versions, but looks something like
this:</li>
</ul>

<pre class="example" id="orga715bff">
\Hydra\dist-newstyle\build\x86_64-windows\ghc-9.2.3\hydra-3.4.15\doc\html\hydra\index.html
</pre>
</div>
</div>

<div id="outline-container-orge174112" class="outline-3">
<h3 id="orge174112"><span class="section-number-3">0.2</span> Installation</h3>
<div class="outline-text-3" id="text-0-2">
</div>
<div id="outline-container-orgefaf9fa" class="outline-4">
<h4 id="orgefaf9fa"><span class="section-number-4">0.2.1</span> Haskell</h4>
<div class="outline-text-4" id="text-0-2-1">
<p>
Hydra requires the ghc toolset for Haskell, including ghc and cabal.
Haskell installers for Macintosh, Windows, and Linux are available
at <a href="https://www.haskell.org/ghcup/">https://www.haskell.org/ghcup/</a>
</p>

<p>
For Windows, an alternative approach is to use chocolatey; see
<a href="https://hub.zhox.com/posts/introducing-haskell-dev/">https://hub.zhox.com/posts/introducing-haskell-dev/</a>
If you have chocolatey installed, you can use it to install Haskell
easily.  Run in Windows PowerShell with administrator priveleges:
</p>

<pre class="example" id="org9579ff6">
choco install ghc --force -y
choco install cabal --force -y
</pre>

<p>
If you have a previous installation, the following might work:
</p>
<pre class="example" id="orga08817e">
choco upgrade ghc cabal -y
</pre>

<ul class="org-ul">
<li>force shouldn't be necessary but seems to be needed if installing
after a failed installation attempt</li>
<li>-y is necessary; this tells choco to answer with y automatically
when it needs permission to do something.  Without the -y, it
doesn't actually ask permission, and the whole installation fails</li>
</ul>

<p>
<i>Test the Haskell tools</i>
</p>

<pre class="example" id="org750bd90">
$ ghc --version
The Glorious Glasgow Haskell Compilation System, version 9.0.1
$ cabal --version
cabal-install version 3.4.0.0
compiled using version 3.4.0.0 of the Cabal library
</pre>
</div>
</div>

<div id="outline-container-org009be7d" class="outline-4">
<h4 id="org009be7d"><span class="section-number-4">0.2.2</span> Install Hydra</h4>
<div class="outline-text-4" id="text-0-2-2">
<ul class="org-ul">
<li>Download the source from <a href="https://github.com/jtod/Hydra">https://github.com/jtod/Hydra</a></li>
<li>Unzip the source file and put it anywhere in your workspace.
<ul class="org-ul">
<li>On Linux: tar -xzf Hydra-i.j.k.tgz</li>
<li>On Windows use zip, 7zip or tar</li>
</ul></li>
<li>In you shell, go to the source directory and enter</li>
</ul>

<pre class="example" id="org00b06fc">
cabal install --lib
cabal haddock
</pre>

<p>
<i>Test the installation</i>
</p>

<p>
In your shell, go to Hydra/examples/adder and enter
</p>

<pre class="example" id="org7756127">
ghc -e main Add4Run
</pre>

<p>
This should produce several lines of simulation output showing inputs
to the adder circuit and the corresponding outputs.
</p>

<p>
<i>Troubleshooting</i>
</p>

<p>
On Windows: If cabal fails, delete this directory and try again:
</p>
<pre class="example" id="org804ea68">
C:\Users\yourname\AppData\Roaming\cabal\store
</pre>

<p>
Additional useful commands; see the ghc User Guide:
</p>
<pre class="example" id="org447d408">
ghc-pkg list
ghc-pkg unregister hydra-i.j.k
</pre>
</div>
</div>
</div>

<div id="outline-container-org42932bb" class="outline-2">
<h2 id="org42932bb"><span class="section-number-2">1</span> About Hydra</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Author: John T. O'Donnell, School of Computing Science, University
of Glasgow</li>
<li>Copyright (c) 2022 John T. O'Donnell</li>
<li>License: This software is free and open source, using the GPL-3
license.  See LICENSE.txt.</li>
<li>Version: see Hydra.cabal</li>
<li>Hydra web page: <a href="https://github.com/jtod/Hydra">https://github.com/jtod/Hydra</a></li>
<li>Author's web page: <a href="https://jtod.github.io/index.html">https://jtod.github.io/index.html</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-06-17 Fri 11:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
